In [1]:
%load_ext sql

In [2]:
#pip install sqlalchemy

In [3]:
#pip install ipython-sql

In [4]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

In [5]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [6]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('16', 'Rylan', 'George', 'M', 'free'),
 ('80', 'Tegan', 'Levine', 'F', 'paid'),
 ('35', 'Molly', 'Taylor', 'F', 'free'),
 ('26', 'Ryan', 'Smith', 'M', 'free'),
 ('69', 'Anabelle', 'Simpson', 'F', 'free')]

In [7]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363)]

In [8]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', 'NaN', 'NaN')]

In [9]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 11, 19, 43, 23, 796000), 19, 11, 45, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 11, 19, 46, 18, 796000), 19, 11, 45, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 11, 20, 14, 51, 796000), 20, 11, 45, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 11, 22, 41, 22, 796000), 22, 11, 45, 11, 2018, '6'),
 (datetime.datetime(2018, 11, 11, 22, 52, 23, 796000), 22, 11, 45, 11, 2018, '6')]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).